app/views/albums/edit.html.erb

    <%= f.label :Artist %><br>
    <%= collection_select( :artist, :artist_id, Artist.all, :id, :artistName, :class => 'form-control' )%>  </div>
---
SELECT `artists`.* FROM `artists`