app/views/albums/new.html.erb

SELECT `artists`.* FROM `artists`
---
    <%= f.label :Artist %><br>
    <%= collection_select( :artist, :artist_id, Artist.all, :id, :artistName, :class => 'form-control' )%>