app/controllers/albums_controller.rb

	def index
	    @album = Album.all.order("created_at DESC")
---
SELECT `albums`.* FROM `albums` ORDER BY created_at DESC

	def create
		@album = Album.new(album_params)

		@album.save
---
INSERT INTO `albums` (`artistName`, `albumName`, `albumYear`, `created_at`, `updated_at`) VALUES ('teste', 'teste', 'teste', '2017-06-20 20:12:53', '2017-06-20 20:12:53')

	def update
	  if @album.update(album_params)
---
UPDATE `albums` SET `artistName` = 'Metallica', `albumName` = 'Black', `albumYear` = '1991', `updated_at` = '2017-07-07 17:57:54' WHERE `albums`.`id` = 6

	def destroy
		@album.destroy
---
DELETE FROM `albums` WHERE `albums`.`id` = 4

	def find_album
		@album = Album.find(params[:id])
---
SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 6 LIMIT 1