app/controllers/artists_controller.rb

	def index
	    @artist = Artist.all.order("created_at DESC")
---
SELECT `artists`.* FROM `artists` ORDER BY created_at DESC

	def new
		@all_artists = Artist.all
---
SELECT `artists`.* FROM `artists` ORDER BY created_at DESC

	def create
		@artist = Artist.new(artist_params)

		@artist.save
---
INSERT INTO "artists" ("artistName", "country", "label", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["artistName", "Antidemon"], ["country", "Brasil"], ["label", "Independente"], ["genre", "Death Metal"], ["created_at", "2017-05-17 11:07:01.843700"], ["updated_at", "2017-05-17 11:07:01.843700"]]

	def update
	  if @artist.update(artist_params)
---
UPDATE `artists` SET `country` = 'Brazil huehue', `updated_at` = '2017-06-13 18:02:21' WHERE `artists`.`id` = 7

	def destroy
		@artist.destroy
---
DELETE FROM `artists` WHERE `artists`.`id` = 1

	def find_artist
		@artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]