app/controllers/artists_controller.rb

	def index
	    @artist = Artist.all
---
SELECT `artists`.* FROM `artists`